#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
;
; shader debug name: 3f0a43583924fc2a1748fb4d48dfe72b.pdb
; shader hash: 3f0a43583924fc2a1748fb4d48dfe72b
;
; Pipeline Runtime Information: 
;
;
;
; Vertex Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer ModelViewProjectionConstantBuffer
; {
;
;   struct dx.alignment.legacy.ModelViewProjectionConstantBuffer
;   {
;
;       column_major float4x4 model;                  ; Offset:    0
;       column_major float4x4 view;                   ; Offset:   64
;       column_major float4x4 projection;             ; Offset:  128
;   
;   } ModelViewProjectionConstantBuffer;              ; Offset:    0 Size:   192
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !51)
!1 = !DIFile(filename: "MS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !48}
!4 = !DISubprogram(name: "MSMain", scope: !1, file: !1, line: 25, type: !5, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @MSMain)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7, !7, !18, !44}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1792, align: 32, elements: !42)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSvert", file: !1, line: 9, size: 224, align: 32, elements: !21)
!21 = !{!22, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 11, baseType: !23, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !25, templateParams: !31)
!25 = !{!26, !28, !29, !30}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, baseType: !27, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !24, file: !1, baseType: !27, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !{!32, !33}
!32 = !DITemplateTypeParameter(name: "element", type: !27)
!33 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 12, baseType: !35, size: 96, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !27, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!32, !16}
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1152, align: 32, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 12)
!48 = !DISubprogram(name: "TransformPosition", linkageName: "\01?TransformPosition@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 15, type: !49, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!23, !23}
!51 = !{!52, !55, !56, !59, !62, !65, !67, !69, !71, !73, !75, !77, !79, !81, !83}
!52 = !DIGlobalVariable(name: "numVertices", scope: !4, file: !1, line: 33, type: !53, isLocal: true, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !11)
!55 = !DIGlobalVariable(name: "numPrimitives", scope: !4, file: !1, line: 34, type: !53, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariable(name: "allVertices", scope: !4, file: !1, line: 37, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 1024, align: 32, elements: !42)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!59 = !DIGlobalVariable(name: "allColors", scope: !4, file: !1, line: 48, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, align: 32, elements: !42)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!62 = !DIGlobalVariable(name: "allIndices", scope: !4, file: !1, line: 59, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1152, align: 32, elements: !46)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!65 = !DIGlobalVariable(name: "allVertices.0", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.0", scope: !4, file: !1, line: 37, type: !66, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.0")
!66 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !57, size: 256, align: 4)
!67 = !DIGlobalVariable(name: "allVertices.1", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.1", scope: !4, file: !1, line: 37, type: !68, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.1")
!68 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !57, size: 256, align: 4, offset: 256)
!69 = !DIGlobalVariable(name: "allVertices.2", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.2", scope: !4, file: !1, line: 37, type: !70, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.2")
!70 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !57, size: 256, align: 4, offset: 512)
!71 = !DIGlobalVariable(name: "allVertices.3", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.3", scope: !4, file: !1, line: 37, type: !72, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.3")
!72 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !57, size: 256, align: 4, offset: 768)
!73 = !DIGlobalVariable(name: "allColors.0", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.0", scope: !4, file: !1, line: 48, type: !74, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.0")
!74 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !60, size: 256, align: 4)
!75 = !DIGlobalVariable(name: "allColors.1", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.1", scope: !4, file: !1, line: 48, type: !76, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.1")
!76 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !60, size: 256, align: 4, offset: 256)
!77 = !DIGlobalVariable(name: "allColors.2", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.2", scope: !4, file: !1, line: 48, type: !78, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.2")
!78 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !60, size: 256, align: 4, offset: 512)
!79 = !DIGlobalVariable(name: "allIndices.0", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.0", scope: !4, file: !1, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.0")
!80 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !63, size: 384, align: 4)
!81 = !DIGlobalVariable(name: "allIndices.1", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.1", scope: !4, file: !1, line: 59, type: !82, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.1")
!82 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !63, size: 384, align: 4, offset: 384)
!83 = !DIGlobalVariable(name: "allIndices.2", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.2", scope: !4, file: !1, line: 59, type: !84, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.2")
!84 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !63, size: 384, align: 4, offset: 768)
!85 = !{i32 2, !"Dwarf Version", i32 4}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{!"dxc 1.2"}
!88 = !{!"MS.hlsl", !"// A constant buffer that stores the three basic column-major matrices for composing geometry.\0D\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0D\0A{\0D\0A\09matrix model;\0D\0A\09matrix view;\0D\0A\09matrix projection;\0D\0A};\0D\0A\0D\0Astruct MSvert\0D\0A{\0D\0A\09float4 pos : SV_POSITION;\0D\0A\09float3 color : COLOR0;\0D\0A};\0D\0A\0D\0Afloat4 TransformPosition(float4 v)\0D\0A{\0D\0A\09v = mul(v, model);\0D\0A\09v = mul(v, view);\0D\0A\09v = mul(v, projection);\0D\0A\09return v;\0D\0A}\0D\0A\0D\0A[outputtopology(\22triangle\22)]\0D\0A[numthreads(12, 1, 1)]\0D\0Avoid MSMain(\0D\0A\09in uint3 groupID : SV_GroupID,\0D\0A\09in uint3 threadInGroup : SV_GroupThreadID,\0D\0A\09out vertices MSvert verts[8],\0D\0A\09out indices uint3 idx[12]) // Three indices per primitive\0D\0A{\0D\0A\09// Although we're running on multiple threads, the threads share\0D\0A\09// the same output arrays (e.g., of indices).\0D\0A\09const uint numVertices = 8;\0D\0A\09const uint numPrimitives = 12;\0D\0A\09SetMeshOutputCounts(numVertices, numPrimitives);\0D\0A\0D\0A\09const float4 allVertices[] = {\0D\0A\09\09float4(-0.5f, -0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, -0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, 0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, 0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(0.5f, -0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(0.5f, -0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(0.5f, 0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(0.5f, 0.5f, 0.5f, 1.0f)\0D\0A\09};\0D\0A\0D\0A\09const float3 allColors[] = {\0D\0A\09\09float3(0.0f, 0.0f, 0.0f),\0D\0A\09\09float3(0.0f, 0.0f, 1.0f),\0D\0A\09\09float3(0.0f, 1.0f, 0.0f),\0D\0A\09\09float3(0.0f, 1.0f, 1.0f),\0D\0A\09\09float3(1.0f, 0.0f, 0.0f),\0D\0A\09\09float3(1.0f, 0.0f, 1.0f),\0D\0A\09\09float3(1.0f, 1.0f, 0.0f),\0D\0A\09\09float3(1.0f, 1.0f, 1.0f)\0D\0A\09};\0D\0A\0D\0A\09const uint3 allIndices[] = {\0D\0A\09\09uint3(0, 2, 1),\0D\0A\09\09uint3(1, 2, 3),\0D\0A\09\09uint3(4, 5, 6),\0D\0A\09\09uint3(5, 7, 6),\0D\0A\09\09uint3(0, 1, 5),\0D\0A\09\09uint3(0, 5, 4),\0D\0A\09\09uint3(2, 6, 7),\0D\0A\09\09uint3(2, 7, 3),\0D\0A\09\09uint3(0, 4, 6),\0D\0A\09\09uint3(0, 6, 2),\0D\0A\09\09uint3(1, 3, 7),\0D\0A\09\09uint3(1, 7, 5)\0D\0A\09};\0D\0A\0D\0A\09uint tid = threadInGroup.x;\0D\0A\0D\0A\09if (tid < numVertices)\0D\0A\09{\0D\0A\09\09verts[tid].pos = TransformPosition(allVertices[tid]);\0D\0A\09\09verts[tid].color = allColors[tid];\0D\0A\09}\0D\0A\0D\0A\09idx[tid] = allIndices[tid];\0D\0A}"}
!89 = !{!"MS.hlsl"}
!90 = !{!"-Od", !"-Qembed_debug", !"-Zi", !"-T", !"ms_6_5", !"-E", !"MSMain"}
!91 = !{i32 1, i32 5}
!92 = !{!"ms", i32 6, i32 5}
!93 = !{null, null, !94, null}
!94 = !{!95}
!95 = !{i32 0, %dx.alignment.legacy.ModelViewProjectionConstantBuffer* undef, !"ModelViewProjectionConstantBuffer", i32 0, i32 0, i32 1, i32 192, null}
!96 = !{i32 0, %struct.MSvert undef, !97, %ModelViewProjectionConstantBuffer undef, !100, %dx.alignment.legacy.ModelViewProjectionConstantBuffer undef, !100}
!97 = !{i32 28, !98, !99}
!98 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!99 = !{i32 6, !"color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!100 = !{i32 192, !101, !103, !104}
!101 = !{i32 6, !"model", i32 2, !102, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!102 = !{i32 4, i32 4, i32 2}
!103 = !{i32 6, !"view", i32 2, !102, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!104 = !{i32 6, !"projection", i32 2, !102, i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!105 = !{i32 1, void ()* @MSMain, !106}
!106 = !{!107}
!107 = !{i32 0, !2, !2}
!108 = !{[3 x i32] [i32 0, i32 7, i32 0]}
!109 = !{void ()* @MSMain, !"MSMain", !110, !93, !117}
!110 = !{null, !111, null}
!111 = !{!112, !115}
!112 = !{i32 0, !"SV_Position", i8 9, i8 3, !113, i8 4, i32 1, i8 4, i32 0, i8 0, !114}
