#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
;
; shader debug name: 8a782c7cb4c6e2b0d48cb36400fe2d05.pdb
; shader hash: 8a782c7cb4c6e2b0d48cb36400fe2d05
;
; Pipeline Runtime Information: 
;
;
;
; Vertex Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer ModelViewProjectionConstantBuffer
; {
;
;   struct dx.alignment.legacy.ModelViewProjectionConstantBuffer
;   {
;
;       column_major float4x4 model;                  ; Offset:    0
;       column_major float4x4 view;                   ; Offset:   64
;       column_major float4x4 projection;             ; Offset:  128
;   
;   } ModelViewProjectionConstantBuffer;              ; Offset:    0 Size:   192
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !53)
!1 = !DIFile(filename: "Content\5CContent\5CMS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !23}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !{!34, !50}
!34 = !DISubprogram(name: "MSMain", scope: !35, file: !35, line: 25, type: !36, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @MSMain)
!35 = !DIFile(filename: "Content\5CMS.hlsl", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !24, !24, !38, !46}
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1792, align: 32, elements: !44)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSvert", file: !35, line: 9, size: 224, align: 32, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !40, file: !35, line: 11, baseType: !4, size: 128, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !40, file: !35, line: 12, baseType: !16, size: 96, align: 32, offset: 128)
!44 = !{!45}
!45 = !DISubrange(count: 8)
!46 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1152, align: 32, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 12)
!50 = !DISubprogram(name: "TransformPosition", linkageName: "\01?TransformPosition@@YA?AV?$vector@M$03@@V1@@Z", scope: !35, file: !35, line: 15, type: !51, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!4, !4}
!53 = !{!54, !57}
!54 = !DIGlobalVariable(name: "numVertices", scope: !34, file: !35, line: 31, type: !55, isLocal: true, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !28)
!57 = !DIGlobalVariable(name: "numPrimitives", scope: !34, file: !35, line: 32, type: !55, isLocal: true, isDefinition: true)
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{!"dxc 1.2"}
!61 = !{!"Content\5CMS.hlsl", !"// A constant buffer that stores the three basic column-major matrices for composing geometry.\0D\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0D\0A{\0D\0A\09matrix model;\0D\0A\09matrix view;\0D\0A\09matrix projection;\0D\0A};\0D\0A\0D\0Astruct MSvert\0D\0A{\0D\0A\09float4 pos : SV_POSITION;\0D\0A\09float3 color : COLOR0;\0D\0A};\0D\0A\0D\0Afloat4 TransformPosition(float4 v)\0D\0A{\0D\0A\09v = mul(v, model);\0D\0A\09v = mul(v, view);\0D\0A\09v = mul(v, projection);\0D\0A\09return v;\0D\0A}\0D\0A\0D\0A[outputtopology(\22triangle\22)]\0D\0A[numthreads(1, 1, 1)]\0D\0Avoid MSMain(\0D\0A\09in uint3 groupID : SV_GroupID,\0D\0A\09in uint3 threadInGroup : SV_GroupThreadID,\0D\0A\09out vertices MSvert verts[8],\0D\0A\09out indices uint3 idx[12]) // Three indices per primitive\0D\0A{\0D\0A\09const uint numVertices = 8;\0D\0A\09const uint numPrimitives = 12;\0D\0A\09SetMeshOutputCounts(numVertices, numPrimitives);\0D\0A\09\0D\0A\09verts[0].pos = TransformPosition(float4(-0.5f, -0.5f, -0.5f, 1.0f));\0D\0A\09verts[0].color = float3(0.0f, 0.0f, 0.0f);\0D\0A\0D\0A\09verts[1].pos = TransformPosition(float4(-0.5f, -0.5f, 0.5f, 1.0f));\0D\0A\09verts[1].color = float3(0.0f, 0.0f, 1.0f);\0D\0A\0D\0A\09verts[2].pos = TransformPosition(float4(-0.5f, 0.5f, -0.5f, 1.0f));\0D\0A\09verts[2].color = float3(0.0f, 1.0f, 0.0f);\0D\0A\0D\0A\09verts[3].pos = TransformPosition(float4(-0.5f, 0.5f, 0.5f, 1.0f));\0D\0A\09verts[3].color = float3(0.0f, 1.0f, 1.0f);\0D\0A\0D\0A\09verts[4].pos = TransformPosition(float4(0.5f, -0.5f, -0.5f, 1.0f));\0D\0A\09verts[4].color = float3(1.0f, 0.0f, 0.0f);\0D\0A\0D\0A\09verts[5].pos = TransformPosition(float4(0.5f, -0.5f, 0.5f, 1.0f));\0D\0A\09verts[5].color = float3(1.0f, 0.0f, 1.0f);\0D\0A\0D\0A\09verts[6].pos = TransformPosition(float4(0.5f, 0.5f, -0.5f, 1.0f));\0D\0A\09verts[6].color = float3(1.0f, 1.0f, 0.0f);\0D\0A\0D\0A\09verts[7].pos = TransformPosition(float4(0.5f, 0.5f, 0.5f, 1.0f));\0D\0A\09verts[7].color = float3(1.0f, 1.0f, 1.0f);\0D\0A\09\0D\0A\09idx[0] = uint3(0, 2, 1);\0D\0A\09idx[1] = uint3(1, 2, 3);\0D\0A\09idx[2] = uint3(4, 5, 6);\0D\0A\09idx[3] = uint3(5, 7, 6);\0D\0A\09idx[4] = uint3(0, 1, 5);\0D\0A\09idx[5] = uint3(0, 5, 4);\0D\0A\09idx[6] = uint3(2, 6, 7);\0D\0A\09idx[7] = uint3(2, 7, 3);\0D\0A\09idx[8] = uint3(0, 4, 6);\0D\0A\09idx[9] = uint3(0, 6, 2);\0D\0A\09idx[10] = uint3(1, 3, 7);\0D\0A\09idx[11] = uint3(1, 7, 5);\0D\0A}"}
!62 = !{!"Content\5CMS.hlsl"}
!63 = !{!"-Od", !"-Qembed_debug", !"-Zi", !"-T", !"ms_6_5", !"-E", !"MSMain"}
!64 = !{i32 1, i32 5}
!65 = !{!"ms", i32 6, i32 5}
!66 = !{null, null, !67, null}
!67 = !{!68}
