#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
;
; shader debug name: 3f0a43583924fc2a1748fb4d48dfe72b.pdb
; shader hash: 3f0a43583924fc2a1748fb4d48dfe72b
;
; Pipeline Runtime Information: 
;
;
;
; Vertex Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer ModelViewProjectionConstantBuffer
; {
;
;   struct dx.alignment.legacy.ModelViewProjectionConstantBuffer
;   {
;
;       column_major float4x4 model;                  ; Offset:    0
;       column_major float4x4 view;                   ; Offset:   64
;       column_major float4x4 projection;             ; Offset:  128
;   
;   } ModelViewProjectionConstantBuffer;              ; Offset:    0 Size:   192
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !52)
!1 = !DIFile(filename: "Content\5CContent\5CMS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !49}
!4 = !DISubprogram(name: "MSMain", scope: !5, file: !5, line: 25, type: !6, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @MSMain)
!5 = !DIFile(filename: "Content\5CMS.hlsl", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{null, !8, !8, !19, !45}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !10, templateParams: !15)
!10 = !{!11, !13, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !9, file: !1, baseType: !12, size: 32, align: 32, flags: DIFlagPublic)
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !9, file: !1, baseType: !12, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !9, file: !1, baseType: !12, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !12)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1792, align: 32, elements: !43)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSvert", file: !5, line: 9, size: 224, align: 32, elements: !22)
!22 = !{!23, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !21, file: !5, line: 11, baseType: !24, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !26, templateParams: !32)
!26 = !{!27, !29, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!32 = !{!33, !34}
!33 = !DITemplateTypeParameter(name: "element", type: !28)
!34 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !21, file: !5, line: 12, baseType: !36, size: 96, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!33, !17}
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1152, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 12)
!49 = !DISubprogram(name: "TransformPosition", linkageName: "\01?TransformPosition@@YA?AV?$vector@M$03@@V1@@Z", scope: !5, file: !5, line: 15, type: !50, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!24, !24}
!52 = !{!53, !56, !57, !60, !63, !66, !68, !70, !72, !74, !76, !78, !80, !82, !84}
!53 = !DIGlobalVariable(name: "numVertices", scope: !4, file: !5, line: 33, type: !54, isLocal: true, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !12)
!56 = !DIGlobalVariable(name: "numPrimitives", scope: !4, file: !5, line: 34, type: !54, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "allVertices", scope: !4, file: !5, line: 37, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1024, align: 32, elements: !43)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!60 = !DIGlobalVariable(name: "allColors", scope: !4, file: !5, line: 48, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, align: 32, elements: !43)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!63 = !DIGlobalVariable(name: "allIndices", scope: !4, file: !5, line: 59, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1152, align: 32, elements: !47)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!66 = !DIGlobalVariable(name: "allVertices.0", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.0", scope: !4, file: !5, line: 37, type: !67, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.0")
!67 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !58, size: 256, align: 4)
!68 = !DIGlobalVariable(name: "allVertices.1", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.1", scope: !4, file: !5, line: 37, type: !69, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.1")
!69 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !58, size: 256, align: 4, offset: 256)
!70 = !DIGlobalVariable(name: "allVertices.2", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.2", scope: !4, file: !5, line: 37, type: !71, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.2")
!71 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !58, size: 256, align: 4, offset: 512)
!72 = !DIGlobalVariable(name: "allVertices.3", linkageName: "\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.3", scope: !4, file: !5, line: 37, type: !73, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allVertices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$03@@B.3")
!73 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !58, size: 256, align: 4, offset: 768)
!74 = !DIGlobalVariable(name: "allColors.0", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.0", scope: !4, file: !5, line: 48, type: !75, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.0")
!75 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !61, size: 256, align: 4)
!76 = !DIGlobalVariable(name: "allColors.1", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.1", scope: !4, file: !5, line: 48, type: !77, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.1")
!77 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !61, size: 256, align: 4, offset: 256)
!78 = !DIGlobalVariable(name: "allColors.2", linkageName: "\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.2", scope: !4, file: !5, line: 48, type: !79, isLocal: false, isDefinition: true, variable: [8 x float]* @"\01?allColors@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV?$vector@M$02@@B.2")
!79 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !61, size: 256, align: 4, offset: 512)
!80 = !DIGlobalVariable(name: "allIndices.0", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.0", scope: !4, file: !5, line: 59, type: !81, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.0")
!81 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !64, size: 384, align: 4)
!82 = !DIGlobalVariable(name: "allIndices.1", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.1", scope: !4, file: !5, line: 59, type: !83, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.1")
!83 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !64, size: 384, align: 4, offset: 384)
!84 = !DIGlobalVariable(name: "allIndices.2", linkageName: "\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.2", scope: !4, file: !5, line: 59, type: !85, isLocal: false, isDefinition: true, variable: [12 x i32]* @"\01?allIndices@?1??MSMain@@YAXV?$vector@I$02@@0Y07$$CAUMSvert@@Y0M@$$CAV2@@Z@3QBV2@B.2")
!85 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !64, size: 384, align: 4, offset: 768)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"dxc 1.2"}
!89 = !{!"Content\5CMS.hlsl", !"// A constant buffer that stores the three basic column-major matrices for composing geometry.\0D\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0D\0A{\0D\0A\09matrix model;\0D\0A\09matrix view;\0D\0A\09matrix projection;\0D\0A};\0D\0A\0D\0Astruct MSvert\0D\0A{\0D\0A\09float4 pos : SV_POSITION;\0D\0A\09float3 color : COLOR0;\0D\0A};\0D\0A\0D\0Afloat4 TransformPosition(float4 v)\0D\0A{\0D\0A\09v = mul(v, model);\0D\0A\09v = mul(v, view);\0D\0A\09v = mul(v, projection);\0D\0A\09return v;\0D\0A}\0D\0A\0D\0A[outputtopology(\22triangle\22)]\0D\0A[numthreads(12, 1, 1)]\0D\0Avoid MSMain(\0D\0A\09in uint3 groupID : SV_GroupID,\0D\0A\09in uint3 threadInGroup : SV_GroupThreadID,\0D\0A\09out vertices MSvert verts[8],\0D\0A\09out indices uint3 idx[12]) // Three indices per primitive\0D\0A{\0D\0A\09// Although we're running on multiple threads, the threads share\0D\0A\09// the same output arrays (e.g., of indices).\0D\0A\09const uint numVertices = 8;\0D\0A\09const uint numPrimitives = 12;\0D\0A\09SetMeshOutputCounts(numVertices, numPrimitives);\0D\0A\0D\0A\09const float4 allVertices[] = {\0D\0A\09\09float4(-0.5f, -0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, -0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, 0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(-0.5f, 0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(0.5f, -0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(0.5f, -0.5f, 0.5f, 1.0f),\0D\0A\09\09float4(0.5f, 0.5f, -0.5f, 1.0f),\0D\0A\09\09float4(0.5f, 0.5f, 0.5f, 1.0f)\0D\0A\09};\0D\0A\0D\0A\09const float3 allColors[] = {\0D\0A\09\09float3(0.0f, 0.0f, 0.0f),\0D\0A\09\09float3(0.0f, 0.0f, 1.0f),\0D\0A\09\09float3(0.0f, 1.0f, 0.0f),\0D\0A\09\09float3(0.0f, 1.0f, 1.0f),\0D\0A\09\09float3(1.0f, 0.0f, 0.0f),\0D\0A\09\09float3(1.0f, 0.0f, 1.0f),\0D\0A\09\09float3(1.0f, 1.0f, 0.0f),\0D\0A\09\09float3(1.0f, 1.0f, 1.0f)\0D\0A\09};\0D\0A\0D\0A\09const uint3 allIndices[] = {\0D\0A\09\09uint3(0, 2, 1),\0D\0A\09\09uint3(1, 2, 3),\0D\0A\09\09uint3(4, 5, 6),\0D\0A\09\09uint3(5, 7, 6),\0D\0A\09\09uint3(0, 1, 5),\0D\0A\09\09uint3(0, 5, 4),\0D\0A\09\09uint3(2, 6, 7),\0D\0A\09\09uint3(2, 7, 3),\0D\0A\09\09uint3(0, 4, 6),\0D\0A\09\09uint3(0, 6, 2),\0D\0A\09\09uint3(1, 3, 7),\0D\0A\09\09uint3(1, 7, 5)\0D\0A\09};\0D\0A\0D\0A\09uint tid = threadInGroup.x;\0D\0A\0D\0A\09if (tid < numVertices)\0D\0A\09{\0D\0A\09\09verts[tid].pos = TransformPosition(allVertices[tid]);\0D\0A\09\09verts[tid].color = allColors[tid];\0D\0A\09}\0D\0A\0D\0A\09idx[tid] = allIndices[tid];\0D\0A}"}
!90 = !{!"Content\5CMS.hlsl"}
!91 = !{!"-Od", !"-Qembed_debug", !"-Zi", !"-T", !"ms_6_5", !"-E", !"MSMain"}
!92 = !{i32 1, i32 5}
!93 = !{!"ms", i32 6, i32 5}
!94 = !{null, null, !95, null}
!95 = !{!96}
!96 = !{i32 0, %dx.alignment.legacy.ModelViewProjectionConstantBuffer* undef, !"ModelViewProjectionConstantBuffer", i32 0, i32 0, i32 1, i32 192, null}
!97 = !{i32 0, %struct.MSvert undef, !98, %ModelViewProjectionConstantBuffer undef, !101, %dx.alignment.legacy.ModelViewProjectionConstantBuffer undef, !101}
!98 = !{i32 28, !99, !100}
!99 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!100 = !{i32 6, !"color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!101 = !{i32 192, !102, !104, !105}
!102 = !{i32 6, !"model", i32 2, !103, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!103 = !{i32 4, i32 4, i32 2}
!104 = !{i32 6, !"view", i32 2, !103, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!105 = !{i32 6, !"projection", i32 2, !103, i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!106 = !{i32 1, void ()* @MSMain, !107}
!107 = !{!108}
!108 = !{i32 0, !2, !2}
!109 = !{[3 x i32] [i32 0, i32 7, i32 0]}
!110 = !{void ()* @MSMain, !"MSMain", !111, !94, !118}
!111 = !{null, !112, null}
!112 = !{!113, !116}
